[
    {
        "desc": "A wide field of grasses and dandelions lay fallow in the shadow of a human nest long abandoned. There are those that come and go, groups of younger humans laughing and sharing a bottle in secret, or sun-touched travelers making music together for whoever will listen. They leave behind all kinds of trinkets and treats hidden in bags and under boxes for one to find, like a reward for solving an especially difficult puzzle. Though nothing catches your eye today."
    },
    {
        "desc": "You find a wire to rest upon near a wide track, where those noisy, metal animals with their human riders run the fastest. They move like the current of a black river, never stopping or resting, as they flow to a set of rules largely unknown to you. Many creatures great and small have forded the black river and lost their lives. If they are thrown from the road than you are lucky, and their loss is your meal, but if they are not the risk of sharing their fate is far too great to chance."
    },
    {
        "desc": "Your swift wings carry you past the sounds of barking cars and noisy machines, to where there are only small, human nests lined up in neat rows. Little songbirds flitter about looking for caches of suet hung up in gardens for them to find, and hummingbirds drink red poison from plastic flowers. Sometimes there are fragrant fruits in this area, smashed open by their fall to the sidewalk below, but it seems the rivaling raccons and squirrels have picked them clean."
    },
    {
        "desc": "You glide between mountains of stone and glass, careful not to fly into the deceptively, reflective surfaces by accident. The riverfront stretches across the horizon, criss-crossed back and forth with bridges carrying humans in all manner of strange metal animals. They also sit on the grass and on benches to look at the glistening water, and leave behind them a wake of pizza crusts and cheeto dust to sup upon. However other crows are thick here today and the squabbling between them for each morsel is more than you want to deal with today."
    }
]