[
    {
        "startingDesc": "Another day dawns for you (User Name), although in the Crowish language you are known by your kin as Caaaaw-Aaack-aaaHH, or Caaw for short. Once again you begin your routine with a quick bath in whatever puddle you can find, and then it’s off to gather a hearty breakfast. The downtown city landscape is coming alive with busy humans who are certain to leave behind tasty treats for you to discover. All you have to do is decide where to look, which way do you want to go?",
        "requiredItem": {
            "type": "Walnut",
            "itemDesc": "There are a few small scraps here and there, but you manage to find a whole walnut to make off with. It's too tough to crack open with your beak alone. You'll have to find another way to get inside."
        },
        "endpoint": {
            "desc": "You find an intersection of black rivers that start and stop with regular frequency, the colorful lights blink from one to the next in a secret code. You were taught it’s sacred meanings from a young age, and now they can be used as a tool for survival. One has to take care however not to be careless when using it.",
            "unresolved": "Empty acorn and peanut shells lay abandoned by kinsmen come before, and the sight of them make your stomach grumble all the more.",
            "resolved": "After the third time you drop your shelled prize at the cross road it is popped open by an oncoming tire. Flying down to examine it’s contents you find a shiny gold coin at its center. What could it mean?"
        }
    },
    {
        "startingDesc": "Momentarily forgetting the instance of your stomach you confer with some of your clan about what this shiny token could mean, and why it was hidden inside your breakfast. Cawww-AhAck says that it is bad news, Ack-Ack-aaaacK seconds the assessment. He says that it is from the Squirrel Kings personal treasury, if they find out you have it they will make as much trouble for you as they can. You’d better return it. Your meal postponed yet again you fly off in search of the Greater Oak, kingdom of squirrels.",
        "requiredItem": {
            "type": "Macaroni Necklace",
            "itemDesc": "Over the river, and in a patch of wilderness untouched by the bustling city surrounding it stands an Oak Savannah. In one particularly gnarled tree you find the Court of the Squirrel king. He sits on a particularly wide throne as he is particularly wide himself, and squirrel attendants zip back forth bringing him a never ending stream of nuts. You look on hungrily, but return the coin with grace. Through a mouthful of cashews the king states he is pleased by your honest nature and that if you would deliver a gift to the Rat Queen he will reward you with all the nuts you could want. Upon your agreement you are given a pristeen macaroni necklace, and are warned that the peace between both kingdoms depend on this gesture."
        },
        "endpoint": {
            "desc": "The gate to the Rat City is well known, but rats are not known for their friendly attitudes towards those not rat and crows don’t like to go underground all that much. You see bars of a storm drain bent backwards and a few of its occupants scuttling in and out. One that looks like a guard, wearing a bottlecap fastened to his head with a rubber band, hisses at you in a very unpleasant way.",
            "unresolved": "You thought they might know directions to the Squirrel Kings tree, but it’s looking like this rat has other ideas if you get too close.",
            "resolved": "It’s only after he scurries away like a shot down that deep, black hole that you realize his vitriol wasn’t aimed at you, but at something behind you. With a squawk and an explosion of movement you narrowly avoid being pounced upon by a stripped, grey tomcat. Feathers ruffled you gaze down at the beast with indignation. No self-respecting crow would be caught dead by a cat. ‘What a pity’, drawled the cat with a stretch, ‘but not a complete loss.’ He picked up the necklace you dropped with a lazy grin. Thanking you for the lovely present he disappears into a dense patch of brushes."
        }
    }
]